In [1]:
import pandas as pd
import numpy as np

In [2]:
data={
    'name': ['Alice', 'Bob', 'Charles', 'David', 'Eric'],
    'year': [2017, 2017, 2017, 2017,2017], 
    'salary': [40000, 24000, 31000, 20000, 30000],
    'pair':[{'a':1},{'a':2},{'a':3},{'a':4},{'a':5}]
}

In [3]:
d=pd.DataFrame(data)

In [4]:
d

      name      pair  salary  year
0    Alice  {'a': 1}   40000  2017
1      Bob  {'a': 2}   24000  2017
2  Charles  {'a': 3}   31000  2017
3    David  {'a': 4}   20000  2017
4     Eric  {'a': 5}   30000  2017